Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyImportInstancesAcrossProjects Property
 Linked Imported Files cannot be copied across projects. All non-RVT linked files will be pasted as imports instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyImportInstancesAcrossProjects { get; }
Public Shared ReadOnly Property CannotCopyImportInstancesAcrossProjects As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyImportInstancesAcrossProjects {
	FailureDefinitionId^ get ();
}
static member CannotCopyImportInstancesAcrossProjects : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace